import streamlit as st

st.set_page_config(
    page_title="Помощник инженера «Траектория-Сервис»", 
    page_icon="🧭", 
    layout="wide"
)

st.title("🧭 Цифровой помощник инженера по ННБ")
st.write("Добро пожаловать в единую экосистему для верификации оборудования и технологических расчетов.")
st.markdown("---")

col1, col2 = st.columns(2)
with col1:
    st.subheader("📋 1. Входной контроль")
    st.write("Сводный чек-лист приемки долот, ВЗД и элементов КНБК по ТТН с автоматической генерацией Акта.")
    st.write(" ")
    st.subheader("📈 3. Матрица рисков")
    st.write("Оперативное выявление скрытых дефектов сборки (яйцо, гидроклин) и ликвидация устьевых осложнений.")

with col2:
    st.subheader("📏 2. Люфт ВЗД")
    st.write("Автономный калькулятор осевого перемещения вала шпинделя с базой лимитов износа Radius, NOV, ВНИИБТ.")
    st.write(" ")
    st.subheader("🧮 4. Расчет УМК")
    st.write("Корректировка паспортного момента затяжки замковых соединений КНБК с учетом геометрии плеча и угла троса.")

st.markdown("---")
st.info("👉 Выберите интересующий вас рабочий модуль в левом боковом меню приложения!")
